## dev: domain
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`





```terraform
Plan: 7 to add, 0 to change, 0 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_acm_certificate.docs_platform_mvp will be created
  + resource "aws_acm_certificate" "docs_platform_mvp" {
      + arn                       = (known after apply)
      + domain_name               = (sensitive)
      + domain_validation_options = [
          + {
              + domain_name           = "*.docs.digital.canada.ca"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
          + {
              + domain_name           = "docs.digital.canada.ca"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = (sensitive)
      + tags                      = {
          + "CostCentre" = "PlatformMVP"
        }
      + tags_all                  = {
          + "CostCentre" = "PlatformMVP"
        }
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # aws_acm_certificate_validation.docs_platform_mvp will be created
  + resource "aws_acm_certificate_validation" "docs_platform_mvp" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # aws_api_gateway_base_path_mapping.docs_platform_mvp will be created
  + resource "aws_api_gateway_base_path_mapping" "docs_platform_mvp" {
      + api_id      = "3qvpbedqeg"
      + domain_name = (sensitive)
      + id          = (known after apply)
      + stage_name  = "dev"
    }

  # aws_api_gateway_domain_name.docs_platform_mvp will be created
  + resource "aws_api_gateway_domain_name" "docs_platform_mvp" {
      + arn                      = (known after apply)
      + certificate_upload_date  = (known after apply)
      + cloudfront_domain_name   = (known after apply)
      + cloudfront_zone_id       = (known after apply)
      + domain_name              = (sensitive)
      + id                       = (known after apply)
      + regional_certificate_arn = (known after apply)
      + regional_domain_name     = (known after apply)
      + regional_zone_id         = (known after apply)
      + security_policy          = "TLS_1_2"
      + tags                     = {
          + "CostCentre" = "PlatformMVP"
        }
      + tags_all                 = {
          + "CostCentre" = "PlatformMVP"
        }

      + endpoint_configuration {
          + types = [
              + "REGIONAL",
            ]
        }
    }

  # aws_route53_record.docs_platform_mvp_A will be created
  + resource "aws_route53_record" "docs_platform_mvp_A" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (sensitive)
      + type            = "A"
      + zone_id         = "Z086862016SKANVEZO0Z3"

      + alias {
          + evaluate_target_health = false
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # aws_route53_record.docs_platform_mvp_validation["*.docs.digital.canada.ca"] will be created
  + resource "aws_route53_record" "docs_platform_mvp_validation" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z086862016SKANVEZO0Z3"
    }

  # aws_route53_record.docs_platform_mvp_validation["docs.digital.canada.ca"] will be created
  + resource "aws_route53_record" "docs_platform_mvp_validation" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z086862016SKANVEZO0Z3"
    }

Plan: 7 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>